[
    {
        "Id": "77829",
        "Text": "<p>It's actually quite simple.  The reason they do this is to make sure you <strong>are</strong> able to help others.  What do I mean by this?  During an emergency where the air in the plane is thinning, it is important that you are able to breathe.  You can become light headed and if you are trying to help someone put their mask on and you are becoming dizzy, it isn't as effective if you are able to think clearly in the situation.</p><p>Think about it this way, imagine you and a friend have been shot in the leg.  If you are in agony and can't think clearly, how much do you think you can help your friend?  Now imagine you have stopped the bleeding on your own leg and bandaged it.  You are now much more capable of providing aid to your friend.</p><p>The same applies here.  If you are sitting next to your family and becoming dizzy, disoriented, and fumbling with your child's mask, you are not just harming yourself to save the child, but also not giving the best aid possible.  It is much better to put your own mask on, remain calm, think clearly, and provide aid to your family so that neither are hindered.</p><p>I'd like to add this (sourced from here: <a href=\"https://cockpitvoice.wordpress.com/2015/07/02/oxygen-mask-adult-first-and-then-children-why/\">Flight Safety</a>)</p><blockquote>  <p>First of all you should know that in a commercial passenger flight the  oxygen masks contain enough oxygen only for 12 minutes and after that  everyone on board will go unconscious due to Hypoxia (oxygen  deprivation). If the flight is at an higher altitude like 20,000 ft.  or above, within 20 to 60 seconds one can get unconscious. This is the  main reason flight attendants always advise you to put the oxygen  masks first and then assist your children or other passengers – in  case of an emergency.</p></blockquote>",
        "Score": "147"
    },
    {
        "Id": "78025",
        "Text": "<p>There is a general principal in medicine -- first of all, do no harm.  This extends to lifesaving practice in that you should, while attempting to help others, not put anyone else at risk <em>including yourself</em>.  </p><p>It simplifies a lot of discussion to say that by first helping yourself you are best able to help your family.  The reason is that you will be clearheaded and able for a longer time.  This has been proven many times for lifesaving: </p><ul><li>running into a burning building that may be about to collapse</li><li>moving someone who has been in a car wreck and may have spinal damage (when there is no imminent danger)</li><li>attempting to separate a biting animal from a person who is being bitten</li><li>grabbing a live electrical wire without proper equipment </li><li>swimming out to try rescuing a person caught in a rip current without equipment (like a float), excellent swimming skills, training</li></ul><p>All of these items and more can put the potential rescuer and others into danger. When you are given directions for lifesaving procedures by authorized personnel, it is pretty safe to assume that they are providing expert advice, though it is sometimes calculated to be the best advice for the least strong, capable or experienced person likely to be in the situation that it covers, it is likely to be the best advice for <strong>you</strong>.</p><p>In a plane, follow the directions of the trained personnel to exit the craft, pay attention to the marked emergency exits, use your seat as a flotation device, take your high heels off before jumping into the emergency exit ramp, and put your mask on first before assisting others! It makes sense when you think about it long enough, but you won't have the time to think about such things <strong>in the event</strong>!</p>",
        "Score": "-2"
    },
    {
        "Id": "102432",
        "Text": "<p>I've tried it again with the same photo on the next day and it worked. Perhaps their online system is overloaded at certain times and one should simply try again in a few hours.</p>",
        "Score": "10"
    },
    {
        "Id": "115082",
        "Text": "<p>I did what Mark Clayton suggested - uploaded a bad quality (low resolution) photo. I took it to the embassy with a physical US passport sized photo and it was fine. There were so many people in the queue without photos uploaded on the forms - it clearly happens to a lot of people!</p>",
        "Score": "2"
    },
    {
        "Id": "169995",
        "Text": "<p><strong>It's not a restaurant, but you may have luck with the <a href=\"https://www.sca.org/\" rel=\"nofollow noreferrer\">Society for Creative Anachronism</a> (the SCA), and Renaissance Festivals, which SCA members frequent or work at.</strong></p><p>The SCA is a group that keeps the arts and culture (and food) of pre-17th century Europe alive.  Everyone will be in period correct garb (or at least an attempt it).  There will be people of varying experience and authenticity at every gathering, but you need to make an effort to be period correct.  There are no \"tourist\" like at a Renaissance Festivals. Many SCA events involve a feast, or at larger/multi-day camping events, there can be 4-5 \"camps\" which do a feast every night. Just like everything else the food is authentic to pre-17th century Europe (except where health codes make it illegal).</p><p>They have public events, which are likely your best source for finding authentic medieval food.  Even at public SCA events you'll be expected to dress authentically.  There is a high degree of overlap between SCA and the local Renaissance Festival.  <strong>Sometimes the Renaissance Festival will have a feast celebrating holidays like the solstice, and the food will be cooked authentically there too.</strong></p><p><a href=\"https://en.wikipedia.org/wiki/Renaissance_fair\" rel=\"nofollow noreferrer\">Most Renaissance Festivals require their vendors show plausibility their merchandise could exists in the middle ages, and is inspired by the period.</a>  I doubt everyone was walking around with turkey legs everyday, but that's an easy place to start.</p><p><strong>If you need help with period correct, head to the Renaissance Festival</strong></p><p>Chat up vendors and buy some things.  They will be able to point you to both local groups and internet resources.</p><p>Also - the food will be good, but simple and under-seasoned by modern standards.  Remember, in medieval Europe spices were very expensive and thus used sparingly.</p><p>My guess as to why there are no \"Authentic medieval restaurants\" is because every other restaurant would beat them in taste.  Even places like Medieval Times will serve more modern food.</p><p><strong>Medieval building does not mean medieval food</strong></p><p>Several answers have posted menus which contain</p><ul><li><p>Tomatoes, potatoes, corn and other \"New World\" food that is indigenous to North America.</p></li><li><p>Carbonated beer - to keep it carbonated you need taps, which didn't exists until 1785.</p></li><li><p>Water, which was unsafe to drink in Medieval times</p></li></ul><p>You'll have a great experience eating at any of these places.  The building is 1000 years old, and plenty of history happened there.  The wait staff will be knowledgable and the food will taste great.</p><p>None of that makes the food authentic.</p><p>Your best bet is still Renaissance Festivals and the SCA.  Both a Renaissance Festivals and a Restaurant are experiential, but the type of experience differs significantly.</p><ol><li><p>A Restaurant focuses on provided great food and drink.  A Renaissance Festival focus on preserving the arts of the middle ages.</p></li><li><p>Le cordon bleu opened in Paris in 1895.  Restaurants usually try to hype their \"classically trained chef\".  Renaissance Festivals go to trouble to make sure both the ingredients and cooking methods were available 500 years prior to this.</p></li><li><p>At restaurants the entertainment is the food and drink, and not having to clean up after.  Renaissance Festivals have glass blowers, blacksmiths, and (my favorite) jousting.</p></li></ol><p>Renaissance Festival isn't selling food.  They're selling a medieval experience, of which simple, under-seasoned food is a part.</p><p><strong>One more edit</strong></p><p>If you read the link about Cardo Culinaria in the original post you'll see why people might not flock to an authentic experience.  All the 20th century people were too fancy to eat with their hands and wanted forks, didn't like Carob juice because lemonade tasted better, and called the food \"interesting\" (read bad).</p><p>Medieval people ate raw foods, simple foods, and under-seasoned foods out of necessity.  The current raw foods/simple foods movement has nothing to do with medieval cooking.</p>",
        "Score": "24"
    },
    {
        "Id": "170029",
        "Text": "<p>I would like to add this restaurant: Krčma U dwau Maryí, Český Krumlov. They serve traditional Bohemian cuisine from the 15th century.</p><p><a href=\"http://www.2marie.cz/\" rel=\"nofollow noreferrer\">http://www.2marie.cz/</a></p><p>Edit: Here's a picture of the \"vegetarian feast\" <a href=\"https://i.stack.imgur.com/38uqS.jpg\" rel=\"nofollow noreferrer\">https://i.stack.imgur.com/38uqS.jpg</a></p>",
        "Score": "1"
    }
]